In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('data/adult.csv')

In [3]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [5]:
df.describe()

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
count,48842.000000,4.884200e+04,48842.000000,48842.000000,48842.000000,48842.000000
mean,38.643585,1.896641e+05,10.078089,1079.067626,87.502314,40.422382
std,13.710510,1.056040e+05,2.570973,7452.019058,403.004552,12.391444
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.175505e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.781445e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.376420e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,4356.000000,99.000000

1.	Каков средний возраст (признак age) женщин?

In [6]:
df[df['gender']=='Female']['age'].mean()

36.92798913043478

2.	Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак salary) и тех, кто получает менее 50K в год?

In [7]:
df['income'].unique()

array(['<=50K', '>50K'], dtype=object)

In [16]:
df.groupby(['income'])['age'].describe()[['mean', 'std']]

             mean        std
income
<=50K   36.872184  14.104118
>50K    44.275178  10.558983

3.	Сколько мужчин и женщин (признак gender) представлено в этом наборе данных?

In [12]:
(df['gender']).shape[0]

48842

In [17]:
df.value_counts(['gender'])

gender
Male      32650
Female    16192
dtype: int64

4.	Какова доля граждан Германии (признак native-country)?

In [13]:
df['native-country'].value_counts(normalize=True)['Germany']

0.00421768150362393

### Формирование сложных запросов

1. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)

In [18]:
df.groupby(['income'])['education'].describe()

        count unique        top   freq
income
<=50K   37155     16    HS-grad  13281
>50K    11687     16  Bachelors   3313

2.	Выведите статистику возраста для каждой расы (признак race) и каждого пола. Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Amer-Indian-Eskimo.

In [33]:
df.groupby(['race','gender'])["age"].max()['Amer-Indian-Eskimo']['Male']

82

3.	Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status)? Женатыми считаем тех, у кого marital-status начинается с Married (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.

In [23]:
x=pd.crosstab(df['income'], df['marital-status'], normalize=True)
print((x.loc['>50K', 'Married-civ-spouse']+x.loc['>50K', 'Married-spouse-absent']+x.loc['>50K', 'Married-AF-spouse'])>0.5)

False

In [26]:
round(df.groupby(['income'])['marital-status'].value_counts(normalize=True),3)

income  marital-status
<=50K   Never-married            0.414
        Married-civ-spouse       0.334
        Divorced                 0.160
        Separated                0.039
        Widowed                  0.037
        Married-spouse-absent    0.015
        Married-AF-spouse        0.001
>50K    Married-civ-spouse       0.854
        Never-married            0.063
        Divorced                 0.057
        Widowed                  0.011
        Separated                0.008
        Married-spouse-absent    0.005
        Married-AF-spouse        0.001
Name: marital-status, dtype: float64

In [27]:
df['marital-status'].value_counts()

Married-civ-spouse       22379
Never-married            16117
Divorced                  6633
Separated                 1530
Widowed                   1518
Married-spouse-absent      628
Married-AF-spouse           37
Name: marital-status, dtype: int64

4.	Какое максимальное число часов человек работает в неделю (признак hours-per-week)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?

In [24]:
df['hours-per-week'].describe()['max']

99.0

In [28]:
df[df['hours-per-week']==99]['income'].value_counts(normalize=True)['>50K']

0.29927007299270075